# InCaret3 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..InCaret3 Property
SymbolTypeId Class See Also
---
Symbol in^3, indicating unit Cubic inches.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId InCaret3 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InCaret3 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InCaret3 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace